Revit 2026 API

# ChangeType Properties

---

The ChangeType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ChangeType Class

Autodesk.Revit.DB Namespace